tutorials/pM4F-Benchmarks/case7/system/graph.cfg
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type            sets;
libs            ("libsampling.so");

writeControl    timeStep; //writeTime;
writeInterval 1;
sets
(
    line
    {
        $setConfig;
        start $start;
        end   $end;
    }
);

// ************************************************************************* //
