tutorials/pM4F-Benchmarks/case7/system/internalProbes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields interpolated to a specified list of points.

\*---------------------------------------------------------------------------*/

fields (eps);
points
(
    (0.1 1 0.005)
);

interpolationScheme cellPoint;
setFormat raw;
sets.ordered yes;

#includeEtc "caseDicts/postProcessing/probes/internalProbes.cfg"

// ************************************************************************* //
