tutorials/pM4F-Benchmarks/case7/system/internalProbes.cfg
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type            sets;
libs            ("libsampling.so");

executeControl  writeTime;
writeControl    writeTime;

sets
(
    ordred yes;
    points
    {
        type    points;
        axis    xyz;
        points  $points;
    }
);

// ************************************************************************* //
