tutorials/pM4F-Benchmarks/case7/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


defaultFieldValues
(
    volScalarFieldValue chi 1
);



regions
(
/*
    cylinderToCell
    {
        p1       (0 0 -10); // start point on cylinder axis
        p2       (0 0 10);   // end point on cylinder axis
        radius   1e-4;
  
        fieldValues
        (
            volScalarFieldValue epsSolid 0 //.999
   			volScalarFieldValue Ci 0 //0.9999
        );
    }
*/
    boxToCell
    {
		box (0 0 0) (0.15 1 1);
        fieldValues
        (
    		volScalarFieldValue chi 2
        );
    }

);

// ************************************************************************* //
