tutorials/pM4F-Benchmarks/case7/system/singleGraph
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.

\*---------------------------------------------------------------------------*/

start   (0.1 1 0.005);
end     (0.1 1 0.005);
fields  (eps);

// Sampling and I/O settings
//#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"
#include "sampleDict.cfg"

// Override settings here, e.g.

setConfig
{
    axis x;        // y, z, xyz
    nPoints		1;
}


// Must be last entry
//#includeEtc "caseDicts/postProcessing/graphs/graph.cfg"
#include "graph.cfg"
// ************************************************************************* //
